_posts/technology/2023-10-28-cppcoreguidelines-t150.html
---
layout: post
title: CppCoreGuidelines T.150 通过 static_assert 检查一个类是否符合某个概念
categories: [technology]
tags: [CppCoreGuidelines]
---
<p>
<a href="http://kimi.im/tags.html#CppCoreGuidelines-ref">C++ 核心指南目录</a>
</p>

<p>
&ldquo;Check that a class matches a concept using static_assert&rdquo;
</p>

<p>
理由
</p>

<p>
如果你想要某个类符合某个概念，尽量在早期进行验证，可以减少用户的痛苦。
</p>


<p>
例子
</p>

<div class="org-src-container">
<pre class="src src-C++"><span style="color: #7F0055; font-weight: bold;">class</span> <span style="color: #000000; font-style: italic; text-decoration: underline;">X</span> <span style="color: #707183;">{</span>
<span style="color: #7F0055; font-weight: bold;">public</span>:
    <span style="color: #0000ff; font-weight: bold;">X</span><span style="color: #7388d6;">()</span> <span style="color: #7F0055; font-weight: bold;">=</span> <span style="color: #7F0055; font-weight: bold;">delete</span>;
    <span style="color: #0000ff; font-weight: bold;">X</span><span style="color: #7388d6;">(</span><span style="color: #7F0055; font-weight: bold;">const</span> <span style="color: #000000; font-style: italic; text-decoration: underline;">X</span><span style="color: #7F0055; font-weight: bold;">&amp;</span><span style="color: #7388d6;">)</span> <span style="color: #7F0055; font-weight: bold;">=</span> <span style="color: #7F0055; font-weight: bold;">default</span>;
    <span style="color: #0000ff; font-weight: bold;">X</span><span style="color: #7388d6;">(</span><span style="color: #000000; font-style: italic; text-decoration: underline;">X</span><span style="color: #7F0055; font-weight: bold;">&amp;&amp;</span><span style="color: #7388d6;">)</span> <span style="color: #7F0055; font-weight: bold;">=</span> <span style="color: #7F0055; font-weight: bold;">default</span>;
    <span style="color: #000000; font-style: italic; text-decoration: underline;">X</span><span style="color: #7F0055; font-weight: bold;">&amp;</span> operator<span style="color: #7F0055; font-weight: bold;">=</span><span style="color: #7388d6;">(</span><span style="color: #7F0055; font-weight: bold;">const</span> <span style="color: #000000; font-style: italic; text-decoration: underline;">X</span><span style="color: #7F0055; font-weight: bold;">&amp;</span><span style="color: #7388d6;">)</span> <span style="color: #7F0055; font-weight: bold;">=</span> <span style="color: #7F0055; font-weight: bold;">default</span>;
    <span style="color: #3F7F5F;">// ...</span>
<span style="color: #707183;">}</span>;
</pre>
</div>

<p>
可以在实现文件的某处，让编译器去检查我们需要的 <code>X</code> 的属性：
</p>

<div class="org-src-container">
<pre class="src src-C++"><span style="color: #3F7F5F;">// error: X has no default constructor</span>
static_assert<span style="color: #707183;">(</span><span style="color: #3a5fcd; font-weight: bold;">Default_constructible</span><span style="color: #7388d6; font-weight: bold;">&lt;</span><span style="color: #000000; font-style: italic; text-decoration: underline;">X</span><span style="color: #7388d6; font-weight: bold;">&gt;</span><span style="color: #707183;">)</span>;
<span style="color: #3F7F5F;">// error: we forgot to define X's move constructor</span>
static_assert<span style="color: #707183;">(</span><span style="color: #3a5fcd; font-weight: bold;">Copyable</span><span style="color: #7388d6; font-weight: bold;">&lt;</span><span style="color: #000000; font-style: italic; text-decoration: underline;">X</span><span style="color: #7388d6; font-weight: bold;">&gt;</span><span style="color: #707183;">)</span>;
</pre>
</div>
